    <script>
    let companyList = [
        {name: "Российский алюминий", spec: "производство алюминия (Москва)", branch: "Металлургия"},
        {name: "УГМК", spec: "производство меди (Верхняя Пышма, Свердловская обл.)", branch: "Металлургия"},
        {name: "ГК «ТАИФ»", spec: "многопрофильный холдинг в Татарстане (Казань)", branch: "Энергетика"},
        {name: "Металлоинвест", spec: "добыча горнорудного сырья, производство стали (Москва)", branch: "Металлургия"},
        {name: "Группа ГАЗ", spec: "производство автомобилей (Нижний Новгород)", branch: "Машиностроение"},
        {name: "Русснефть", spec: "добыча и переработка нефти (Москва)", branch: "Энергетика"},
        {name: "МегаФон", spec: "оператор сотовой связи (Москва)", branch: "Телекоммуникации"},
        {name: "Эльдорадо (сеть магазинов)", spec: "магазины электроники и бытовой техники (Москва)", branch: "Торговля"},
        {name: "Евросеть", spec: "салоны сотовой связи (Москва)", branch: "Торговля"},
        {name: "Объединенная металлургическая компания", spec: "производство труб (Москва)", branch: "Металлургия"},
        {name: "Группа «СОК»", spec: "производство и продажа автомобилей и запчастей (Самара)", branch: "Машиностроение"},
        {name: "Рольф", spec: "импорт и продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "СИА Интернейшнл", spec: "производство и оптовая продажа лекарств (Москва)", branch: "Оптовая торговля"},
        {name: "Мегаполис (компания)", spec: "торговля табачными изделиями (Москва)", branch: "Оптовая торговля"},
        {name: "СУЭК", spec: "добыча угля (Москва)", branch: "Угольная"},
        {name: "Группа компаний «Протек»", spec: "торговля лекарствами (Москва)", branch: "Оптовая торговля"},
        {name: "Группа ЧТПЗ", spec: "производство труб, цинка (Челябинск)", branch: "Металлургия"},
        {name: "SNS", spec: "оптовая торговля сигаретами (Москва)", branch: "Оптовая торговля"},
        {name: "Русская медная компания", spec: "производство меди (Екатеринбург)", branch: "Металлургия"},
        {name: "Трансмашхолдинг", spec: "производство локомотивов и вагонов (Москва)", branch: "Машиностроение"},
        {name: "Еврохим", spec: "производство удобрений (Москва)", branch: "Химия"},
        {name: "Группа «Альянс»", spec: "добыча и переработка нефти (Москва)", branch: "Энергетика"},
        {name: "Евроцемент", spec: "производство цемента (Москва)", branch: "Строительство"},
        {name: "Группа «Илим»", spec: "древесина, целлюлоза, фанера, картон (Санкт-Петербург)", branch: "Иные"},
        {name: "Северстальтранс", spec: "ж/д перевозки, порты, производство тепловозов (Москва)", branch: "Службы доставки"},
        {name: "Промышленно-металлургический холдинг", spec: "производство стали, кокса, чугуна, никеля, добыча угля (Москва)", branch: "Металлургия"},
        {name: "Комплексные энергетические системы", spec: "продажа электричества и газа (Москва)", branch: "Оптовая торговля"},
        {name: "Фосагро", spec: "производство удобрений (Москва)", branch: "Химия"},
        {name: "Глобалстрой-инжиниринг", spec: "строительство (Когалым, Тюменская обл.)", branch: "Строительство"},
        {name: "М.Видео", spec: "магазины электроники и бытовой техники (Москва)", branch: "Торговля"},
        {name: "Трансстрой", spec: "дорожное и прочее строительство (Москва)", branch: "Строительство"},
        {name: "Евросервис", spec: "производство сахара, импорт мяса (Санкт-Петербург)", branch: "Пищевая пром."},
        {name: "Merlion", spec: "торговля компьютерными комплектующими (Москва)", branch: "Электроника"},
        {name: "ДОН-строй", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Major", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Евросибэнерго", spec: "электроэнергетика (Москва)", branch: "Энергетика"},
        {name: "Ritzio Entertainment Group", spec: "казино, игровые сети «Вулкан», «Миллион» и др. (Москва)", branch: "Развлечения"},
        {name: "Ист Лайн", spec: "управляет аэропортом «Домодедово» (Московская область)", branch: "Службы доставки"},
        {name: "Связной", spec: "салоны сотовой связи (Москва)", branch: "Торговля"},
        {name: "Трансбункер", spec: "заправка судов топливом (Москва)", branch: "Оптовая торговля"},
        {name: "Национальная компьютерная корпорация", spec: "производство и продажа компьютеров (Москва)", branch: "Электроника"},
        {name: "СУ-155", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Автомир", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Корпорация «Главстрой»", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Атлант-М", spec: "торговля автомобилями (Москва)", branch: "Торговля"},
        {name: "Лента", spec: "сеть магазинов Cash & Carry (Санкт-Петербург)", branch: "Торговля"},
        {name: "Техносила", spec: "магазины бытовой техники и электроники (Москва)", branch: "Торговля"},
        {name: "Буровая компания «Евразия»", spec: "бурение нефтяных и газовых скважин (Москва)", branch: "Иные"},
        {name: "Торговый дом «Копейка»", spec: "сеть универсамов (Москва)", branch: "Торговля"},
        {name: "Ариант", spec: "производство ферросплавов, продуктов питания (Челябинск)", branch: "Металлургия"},
        {name: "Зерновая компания «Настюша»", spec: "производство муки (Москва)", branch: "Пищевая пром."},
        {name: "Энергостройинвест-Холдинг", spec: "строительство линий электропередач (Москва)", branch: "Строительство"},
        {name: "Концерн «Тракторные заводы»", spec: "производство тракторов и комплектующих (Чебоксары)", branch: "Машиностроение"},
        {name: "Эксперт-Корсо", spec: "торговля электроникой и бытовой техникой (Москва)", branch: "Торговля"},
        {name: "Итера", spec: "нефте- и газодобыча (Москва)", branch: "Энергетика"},
        {name: "Русагро", spec: "производство сахара (Москва)", branch: "Пищевая пром."},
        {name: "Трансгрупп", spec: "железнодорожные перевозки (Москва)", branch: "Службы доставки"},
        {name: "АТЭК/Кесно-М", spec: "нефтетрейдинг, недвижимость (Уфа)", branch: "Оптовая торговля"},
        {name: "ЛАНИТ", spec: "производство компьютеров, системная интеграция (Москва)", branch: "Электроника"},
        {name: "Уфаойл-Оптан", spec: "торговля нефтепродуктами (Уфа)", branch: "Оптовая торговля"},
        {name: "Юнимилк", spec: "молочные продукты (Москва)", branch: "Пищевая пром."},
        {name: "Mercury", spec: "продажа предметов роскоши (Москва)", branch: "Торговля"},
        {name: "Роста", spec: "торговля лекарствами (Москва)", branch: "Оптовая торговля"},
        {name: "Виктория", spec: "сеть супермаркетов (Москва)", branch: "Торговля"},
        {name: "Технониколь", spec: "производство кровельных материалов (Москва)", branch: "Строительство"},
        {name: "Русэнергосбыт", spec: "продажа электроэнергии (Москва)", branch: "Оптовая торговля"},
        {name: "Группа ЛСР", spec: "строительство, девелопмент (Санкт-Петербург)", branch: "Строительство"},
        {name: "Сталепромышленная компания", spec: "торговля металлопрокатом (Екатеринбург)", branch: "Оптовая торговля"},
        {name: "Автотор", spec: "производство автомобилей (Калининград)", branch: "Машиностроение"},
        {name: "Продо", spec: "животноводство производство продуктов питания (Москва)", branch: "Пищевая пром."},
        {name: "Объединенные кондитеры", spec: "производство кондитерских изделий (Москва)", branch: "Пищевая пром."},
        {name: "Формоза", spec: "производство компьютеров (Москва)", branch: "Электроника"},
        {name: "Техносерв А/С", spec: "системная интеграция (Москва)", branch: "Электроника"},
        {name: "Объединенная промышленная корпорация", spec: "судостроение (Москва)", branch: "Машиностроение"},
        {name: "Сибирский деловой союз", spec: "добыча угля, машиностроение (Кемерово)", branch: "Машиностроение"},
        {name: "Интеко", spec: "строительство, изделия из пластмасс (Москва)", branch: "Строительство"},
        {name: "IBS", spec: "системная интеграция, продажа компьютеров (Москва)", branch: "Электроника"},
        {name: "Цифроград", spec: "продажа электроники (Москва)", branch: "Торговля"},
        {name: "Биоток", spec: "производство и продажа лекарств (Москва)", branch: "Оптовая торговля"},
        {name: "Ultra Electronics", spec: "продажа компьютерной техники (Москва)", branch: "Электроника"},
        {name: "Dixis", spec: "сеть салонов связи (Москва)", branch: "Торговля"},
        {name: "МАИР", spec: "торговля металлоломом, производство стали (Москва)", branch: "Металлургия"},
        {name: "Группа «Эстар»", spec: "производство стали, труб (Москва)", branch: "Металлургия"},
        {name: "Ингеоком", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Волга-Днепр", spec: "перевозка грузов авиатранспортом (Ульяновск)", branch: "Службы доставки"},
        {name: "Транснефтьсервис-С", spec: "продажа электроэнергии (Москва)", branch: "Оптовая торговля"},
        {name: "R-Style", spec: "торговля компьютерами (Москва)", branch: "Электроника"},
        {name: "Группа «Бородино»", spec: "производство продуктов питания, девелопмент (Москва)", branch: "Пищевая пром."},
        {name: "Фирма Илиев", spec: "торговая недвижимость (Москва)", branch: "Иные"},
        {name: "О’Кей", spec: "сеть гипермаркетов (Санкт-Петербург)", branch: "Торговля"},
        {name: "НПК «Катрен»", spec: "торговля лекарствами (Новосибирск)", branch: "Оптовая торговля"},
        {name: "Конструктивное бюро", spec: "химическая промышленность (Москва)", branch: "Химия"},
        {name: "Мосинжстрой", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Retal Industries", spec: "производство пищевой упаковки (Москва)", branch: "Химия"},
        {name: "МАКСИ-групп", spec: "переработка металлолома, выпуск стали (Екатеринбург)", branch: "Металлургия"},
        {name: "Югтранзитсервис", spec: "сельское хозяйство, экспорт зерна (Таганрог)", branch: "Пищевая пром."},
        {name: "АСТ", spec: "розничная торговля, управление недвижимостью (Москва)", branch: "Иные"},
        {name: "Спортмастер", spec: "магазины спортивной одежды и инвентаря (Москва)", branch: "Торговля"},
        {name: "Юг Руси", spec: "переработка подсолнечника (Ростов-на-Дону)", branch: "Пищевая пром."},
        {name: "Беталинк", spec: "салоны сотовой связи (Москва)", branch: "Торговля"},
        {name: "Сибуглемет", spec: "добыча угля (Новокузнецк, Кемеровская обл.)", branch: "Угольная"},
        {name: "Продимекс", spec: "торговля сельхозпродукцией (Москва)", branch: "Пищевая пром."},
        {name: "Телебалт", spec: "производство бытовой техники (Калининград)", branch: "Иные"},
        {name: "Эксима", spec: "мясокомбинаты, сельское хозяйство, торговля (Москва)", branch: "Пищевая пром."},
        {name: "Новое содружество", spec: "производство комбайнов, красок (Москва)", branch: "Машиностроение"},
        {name: "Мир", spec: "магазины электроники и бытовой техники (Москва)", branch: "Торговля"},
        {name: "Инком-недвижимость", spec: "девелопмент (Москва)", branch: "Строительство"},
        {name: "Группа «Е4»", spec: "проектирование, строительство электростанций (Москва)", branch: "Строительство"},
        {name: "ТагАЗ", spec: "производство автомобилей, таксопарки (Ростов-на-Дону)", branch: "Машиностроение"},
        {name: "Мираторг", spec: "импорт мяса, животноводство (Москва)", branch: "Пищевая пром."},
        {name: "Марта", spec: "розничная торговля, производство мебели (Москва)", branch: "Торговля"},
        {name: "Rolsen", spec: "производство бытовой электроники (Сеул)", branch: "Иные"},
        {name: "Гема", spec: "продажа автомобилей, транспортные услуги (Москва)", branch: "Торговля"},
        {name: "Петербургская топливная компания", spec: "сеть автозаправочных станций (Санкт-Петербург)", branch: "Торговля"},
        {name: "NT Computer", spec: "производство компьютеров (Москва)", branch: "Электроника"},
        {name: "Трансойл", spec: "перевозка нефти и нефтепродуктов (Санкт-Петербург)", branch: "Службы доставки"},
        {name: "Агрохолдинг", spec: "свинокомплексы, птицефабрики (Курск)", branch: "Пищевая пром."},
        {name: "Металлсервис", spec: "торговля металлами (Москва)", branch: "Оптовая торговля"},
        {name: "Mirax Group", spec: "девелопмент (Москва)", branch: "Строительство"},
        {name: "Мосстроимеханизация-5", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Дальневосточная транспортная группа", spec: "железнодорожные грузоперевозки (Москва)", branch: "Службы доставки"},
        {name: "Трансаэро", spec: "авиаперевозки (Москва)", branch: "Службы доставки"},
        {name: "Нью-Йорк Моторс-Москва", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Миэль-Недвижимостъ", spec: "девелопмент (Москва)", branch: "Строительство"},
        {name: "Астон", spec: "сельское хозяйство, пищевая промышленность (Ростов-на-Дону)", branch: "Пищевая пром."},
        {name: "Лаверна", spec: "оптовая торговля отделочными материалами (Санкт-Петербург)", branch: "Оптовая торговля"},
        {name: "Лас-Вегас. Игровая система", spec: "игорный бизнес (Самара)", branch: "Развлечения"},
        {name: "Sunway", spec: "оптовая торговля фруктами (Санкт-Петербург)", branch: "Оптовая торговля"},
        {name: "Капитал Груп", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Verysell", spec: "системная интеграция (Москва)", branch: "Электроника"},
        {name: "Евросиб", spec: "транспорт и торговля автомобилями (Санкт-Петербург)", branch: "Службы доставки"},
        {name: "Мосмарт", spec: "розничная торговля (Москва)", branch: "Торговля"},
        {name: "Группа СИБПЛАЗ", spec: "производство редкоземельных и цветных металлов (Кемерово, Кемеровская обл.)", branch: "Металлургия"},
        {name: "КРОК инкорпорейтед", spec: "системная интеграция (Москва)", branch: "Электроника"},
        {name: "Инпром", spec: "торговля прокатом и трубами (Таганрог)", branch: "Оптовая торговля"},
        {name: "ЗАО «ГК „Электрощит“»", spec: "Производство электротехнического оборудования (Самара)", branch: "Машиностроение"},
        {name: "Инком-Авто", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Видео Интернешнл", spec: "реклама (Москва)", branch: "Иные"},
        {name: "Кристалл-Лефортово", spec: "торговля алкоголем (Москва)", branch: "Оптовая торговля"},
        {name: "Боско ди Чильеджи", spec: "продажа предметов роскоши (Москва)", branch: "Торговля"},
        {name: "Crocus Group", spec: "недвижимость, торговля предметами роскоши (Москва)", branch: "Иные"},
        {name: "Русский уголь", spec: "добыча угля (Москва)", branch: "Угольная"},
        {name: "Солнечные продукты", spec: "производство майонеза, растительного масла (Москва)", branch: "Пищевая пром."},
        {name: "Омега-97", spec: "универсамы «Патэрсон» (Москва)", branch: "Торговля"},
        {name: "Градиент", spec: "торговля парфюмерией, косметикой (Москва)", branch: "Оптовая торговля"},
        {name: "Sport Shop Sabanikh", spec: "Оптовая торговля, одежда (Москва)", branch: "Оптовая торговля"},
        {name: "Genser", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Оренсал", spec: "поставки газа и нефтяного конденсата (Оренбург)", branch: "Энергетика"},
        {name: "Проф-Медиа", spec: "медиабизнес (Москва)", branch: "Иные"},
        {name: "МИАН", spec: "девелопмент (Москва)", branch: "Строительство"},
        {name: "JFC", spec: "оптовая торговля фруктами (Санкт-Петербург)", branch: "Оптовая торговля"},
        {name: "Морон", spec: "оптовая торговля лекарствами (Москва)", branch: "Оптовая торговля"},
        {name: "Очаково", spec: "пиво, безалкогольные напитки (Москва)", branch: "Пищевая пром."},
        {name: "Союзнефтегаз", spec: "торговля нефтепродуктами, сервисные услуги (Москва)", branch: "Торговля"},
        {name: "Балтийская строительная компания", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Группа «ОСТ»", spec: "алкогольные и безалкогольные напитки (Московская область)", branch: "Пищевая пром."},
        {name: "Альянс Русский текстиль", spec: "производство пряжи и тканей (Москва)", branch: "Иные"},
        {name: "Восток-Сервис", spec: "производство и продажа спецодежды (Москва)", branch: "Иные"},
        {name: "Холидей Классик", spec: "розничная торговля (Новосибирск)", branch: "Торговля"},
        {name: "Вестер", spec: "розничная торговля (Калининград)", branch: "Торговля"},
        {name: "Авто Мотор Группа (Арманд)", spec: "продажа автомобилей (Москва)", branch: "Торговля"},
        {name: "Карусель", spec: "сеть гипермаркетов (Санкт-Петербург)", branch: "Торговля"},
        {name: "ОТЭКО", spec: "ж/д перевозка нефтепродуктов (Москва)", branch: "Службы доставки"},
        {name: "ЮНЭКТ", spec: "оптовая торговля сигаретами (Москва)", branch: "Оптовая торговля"},
        {name: "Группа ОГО", spec: "сельское хозяйство, пищевая промышленность (Москва)", branch: "Пищевая пром."},
        {name: "Оптифуд", spec: "импорт продуктов питания, птицефабрики (Москва)", branch: "Пищевая пром."},
        {name: "Аэродромдорстрой", spec: "строительство (Тюмень)", branch: "Строительство"},
        {name: "Руст Инк", spec: "производство и продажа алкогольной продукции (Москва)", branch: "Пищевая пром."},
        {name: "Корпорация С.Холдинг", spec: "девелопмент строительство (Москва)", branch: "Строительство"},
        {name: "МФС-6", spec: "строительство (Москва)", branch: "Строительство"},
        {name: "Стойленская нива", spec: "сельское хозяйство, пищевая промышленность (Старый Оскол)", branch: "Пищевая пром."},
        {name: "Алпи", spec: "сеть магазинов, пищевая промышленность (Красноярск)", branch: "Торговля"},
        {name: "Супермаркет Кировский", spec: "сеть супермаркетов (Екатеринбург)", branch: "Торговля"},
        {name: "Сибирско-Амурская сталь", spec: "производство стали (Москва)", branch: "Металлургия"},
        {name: "СХ Трейдинг", spec: "магазины «Старик Хоттабыч» (Московская область)", branch: "Торговля"},
        {name: "АГРИКО", spec: "животноводство, растениеводство (Москва)", branch: "Пищевая пром."},
        {name: "Инна тур", spec: "туризм, авиабилеты (Москва)", branch: "Развлечения"},
        {name: "Русское море", spec: "производство и продажа рыбной продукции (Москва)", branch: "Пищевая пром."},
        {name: "ТрансТехСервис", spec: "продажа автомобилей (Казань)", branch: "Торговля"},
        {name: "АвтоВАЗагрегат", spec: "производство автокомплектуюших (Тольятти)", branch: "Машиностроение"},
        {name: "ДжамильКо", spec: "продажа предметов роскоши (Москва)", branch: "Торговля"},
        {name: "Орими трейд", spec: "продажа чая, кофе (Санкт-Петербург)", branch: "Оптовая торговля"},
        {name: "Аэрофьюэлз групп", spec: "заправка самолетов (Москва)", branch: "Оптовая торговля"},
        {name: "Европласт", spec: "производство пищевой упаковки (Москва)", branch: "Химия"},
        {name: "Сорус", spec: "оптовая торговля фруктами (Санкт-Петербург)", branch: "Оптовая торговля"},
        {name: "Останкинский МПЗ", spec: "мясопереработка (Москва)", branch: "Пищевая пром."} 
    ];
</script>


<main class="flex">
    <div class="purpleDiv"></div>
    <div class="glass">
        <div class="inputBox flex">
            <svg class="m-c" style="margin-left: 1rem;" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fill-rule="evenodd" clip-rule="evenodd" d="M17.0625 0C26.4859 0 34.125 7.63914 34.125 17.0625C34.125 20.9049 32.8549 24.4507 30.7116 27.3029L30.8453 27.4074L30.9736 27.5264L38.2861 34.8389C39.238 35.7908 39.238 37.3342 38.2861 38.2861C37.4074 39.1648 36.0248 39.2323 35.0686 38.4888L34.8389 38.2861L27.5264 30.9736C27.4431 30.8902 27.367 30.8023 27.2982 30.7106C24.4507 32.8549 20.9049 34.125 17.0625 34.125C7.63914 34.125 0 26.4859 0 17.0625C0 7.63914 7.63914 0 17.0625 0ZM17.0625 4.875C10.3315 4.875 4.875 10.3315 4.875 17.0625C4.875 23.7935 10.3315 29.25 17.0625 29.25C23.7935 29.25 29.25 23.7935 29.25 17.0625C29.25 10.3315 23.7935 4.875 17.0625 4.875Z" fill="url(#paint0_linear)"/>
                <defs>
                <linearGradient id="paint0_linear" x1="39" y1="-1.16229e-06" x2="1.91193e-07" y2="49.5625" gradientUnits="userSpaceOnUse">
                <stop stop-color="#A55EEA"/>
                <stop offset="1" stop-color="#3867D6"/>
                </linearGradient>
                </defs>
            </svg>
                
            <input type="text" placeholder="Введите название компании...">
            <button class="gradButtonPurple">Сброс</button>
        </div>
        {#each companyList as company}
            <p>{company.name} {company.spec} {company.branch}</p>
        {/each}
    </div>
</main>

<style>
    .purpleDiv{
        width: 100%;
        height: 100vh;
        background: radial-gradient(farthest-corner at 40px 40px, #45AAF2 0%, #4B7BEC 45.83%, #A55EEA 100%);
    }
    .glass{
        position: absolute;
        border-radius: 30px;
        left: 15%;
        top: 10vh;
        width: 70%;
        height: 80vh;
        background: linear-gradient(0deg, rgba(75, 123, 236, 0.2), rgba(75, 123, 236, 0.2)),
        linear-gradient(0deg, rgba(255, 255, 255, 0.8), rgba(255, 255, 255, 0.8));
        backdrop-filter: blur(24px);
    }
    .inputBox{
        background-color: #FFFFFFCC;

        height: 4rem;
        border-radius: 30px;
    }
    .inputBox input{
        background: transparent;
        font-family: 'M PLUS 1p', sans-serif;
        font-size: 18px;
        width: 80%;
        outline: none;
        border: none;
        height: 4rem;
        margin-left: 1rem;
    }
    .inputBox button{
        margin-left: auto;
        letter-spacing: 1px;
        padding-left: 2rem;
        padding-right: 2rem;
    }
</style>